  # Напишите программу, которая создает список из 5 строк
  # и меняет первый и последний элементы в нём.
user_list = ["one", "two", "three", "four", "five"]

print(user_list)

user_list[0] = "1"
user_list[-1] = "5"

print(user_list)