# Напишите программу, в которой создадите и заполните список,
my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 0]
print(my_list)

unique_elements = set(my_list)
print(unique_elements)
#а затем посчитаете количество уникальных элементов в нём и выведите на экран.
number_unique_elements = len(unique_elements)
print(number_unique_elements)